labwork6/src/DocumentJournals/КассовыеДокументы/КассовыеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>КассовыеДокументы</name>
  <registeredDocuments>Document.ПриходныйКассовыйОрдер</registeredDocuments>
  <registeredDocuments>Document.РасходныйКассовыйОрдер</registeredDocuments>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>Сумма</name>
  </columns>
  <columns>
    <name>Счет</name>
  </columns>
  <columns>
    <name>Валюта</name>
  </columns>
</mdclass:DocumentJournal>

labwork6/src/AccumulationRegisters/Касса/Касса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Касса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.СчетаОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

labwork6/src/DocumentJournals/КассовыеДокументы/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	Остаток = СписокПриАктивизацииСтрокиНаСервере(ДанныеСтроки.Счет);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(Счет)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КассаОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Касса.Остатки(&Дата, СчетОрганизации = &СчетОрганизации) КАК КассаОстатки";
	
	Запрос.УстановитьПараметр("СчетОрганизации", Счет);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	
КонецФункции
